In [1]:
import pandas
pandas.__version__

'1.0.5'

In [2]:
import numpy as np
import pandas as pd

In [3]:
counts = pd.Series([333,456,789,123,678,43567])
counts

0      333
1      456
2      789
3      123
4      678
5    43567
dtype: int64

In [4]:
counts.values

array([  333,   456,   789,   123,   678, 43567])

In [5]:
counts.index

RangeIndex(start=0, stop=6, step=1)

In [23]:
countries= pd.Series([1,2,3,4000],index =['india','uae','aus','usa'])
countries

india       1
uae         2
aus         3
usa      4000
dtype: int64

In [24]:
countries['uae']

2

In [25]:
countries[3]

4000

In [26]:
countries.name = 'countries list'
countries.index.name = 'country'
countries

country
india       1
uae         2
aus         3
usa      4000
Name: countries list, dtype: int64

In [27]:
np.log(countries)

country
india    0.000000
uae      0.693147
aus      1.098612
usa      8.294050
Name: countries list, dtype: float64

In [28]:
countries[countries>2000]

country
usa    4000
Name: countries list, dtype: int64

In [29]:
countries_dict = {'india': 345, 'uae': 1800, 'usa': 678, 'aus': 213}
print(countries_dict)
pd.Series(countries_dict)

{'india': 345, 'uae': 1800, 'usa': 678, 'aus': 213}

india     345
uae      1800
usa       678
aus       213
dtype: int64

In [32]:
data = {"Name": ['abdul','ahad','irfan','farhan'],
        "year": [1999,1999,1996,2007],
        "age": [20,21,24,11]}
print(data)
data = pd.DataFrame(data)
data

{'Name': ['abdul', 'ahad', 'irfan', 'farhan'], 'year': [1999, 1999, 1996, 2007], 'age': [20, 21, 24, 11]}

     Name  year  age
0   abdul  1999   20
1    ahad  1999   21
2   irfan  1996   24
3  farhan  2007   11

In [36]:
df = pd.DataFrame(data, columns=['Name','age','year'])
df

     Name  age  year
0   abdul   20  1999
1    ahad   21  1999
2   irfan   24  1996
3  farhan   11  2007

In [37]:
df['nonsense'] = df.age/ df.year
df

     Name  age  year  nonsense
0   abdul   20  1999  0.010005
1    ahad   21  1999  0.010505
2   irfan   24  1996  0.012024
3  farhan   11  2007  0.005481

In [41]:
df['series_aligned'] = pd.Series(range(4),index = [0,1,2,3,])
df

     Name  age  year  nonsense  series_aligned
0   abdul   20  1999  0.010005               0
1    ahad   21  1999  0.010505               1
2   irfan   24  1996  0.012024               2
3  farhan   11  2007  0.005481               3

In [42]:
df.to_dict()

{'Name': {0: 'abdul', 1: 'ahad', 2: 'irfan', 3: 'farhan'},
 'age': {0: 20, 1: 21, 2: 24, 3: 11},
 'year': {0: 1999, 1: 1999, 2: 1996, 3: 2007},
 'nonsense': {0: 0.010005002501250625,
  1: 0.010505252626313157,
  2: 0.012024048096192385,
  3: 0.005480817140009965},
 'series_aligned': {0: 0, 1: 1, 2: 2, 3: 3}}

In [43]:
pd.DataFrame(df.to_dict())

     Name  age  year  nonsense  series_aligned
0   abdul   20  1999  0.010005               0
1    ahad   21  1999  0.010505               1
2   irfan   24  1996  0.012024               2
3  farhan   11  2007  0.005481               3

In [44]:
data = [{'a': i, 'b':35* i}for i in range(8)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 35}, {'a': 2, 'b': 70}, {'a': 3, 'b': 105}, {'a': 4, 'b': 140}, {'a': 5, 'b': 175}, {'a': 6, 'b': 210}, {'a': 7, 'b': 245}]

   a    b
0  0    0
1  1   35
2  2   70
3  3  105
4  4  140
5  5  175
6  6  210
7  7  245

In [45]:
pd.DataFrame([{'aa': 1, 'bb': 2}, {'bb': 3, 'cc': 6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [48]:
pd.DataFrame(np.random.randint(2, 15),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

   foo  bar
a    3    3
b    3    3
c    3    3

In [49]:
ind = pd.Index([20, 34, 57, 7, 1, 8])
ind

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [50]:
ind[4]

1

In [51]:
ind[::]

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [52]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

6 (6,) 1 int64

In [53]:
rng = np.random.RandomState(20)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    3
1    9
2    4
3    6
dtype: int64

In [54]:
dfr = pd.DataFrame(rng.randint(0, 10, (5, 4)),
                  columns=['A', 'B', 'C', 'D'])
dfr

   A  B  C  D
0  7  2  0  6
1  8  5  3  0
2  6  6  0  9
3  5  7  5  2
4  6  9  3  3

In [55]:
np.exp(ser)

0      20.085537
1    8103.083928
2      54.598150
3     403.428793
dtype: float64

In [56]:
np.log(ser)

0    1.098612
1    2.197225
2    1.386294
3    1.791759
dtype: float64

In [57]:
np.sin(dfr * np.pi / 4)

              A         B         C         D
0 -7.071068e-01  1.000000  0.000000 -1.000000
1 -2.449294e-16 -0.707107  0.707107  0.000000
2 -1.000000e+00 -1.000000  0.000000  0.707107
3 -7.071068e-01 -0.707107 -0.707107  1.000000
4 -1.000000e+00  0.707107  0.707107  0.707107

In [62]:
area = pd.Series({'indiranagar': 1723337, 'bml': 695662,
                  'btm': 423967}, name='area')
population = pd.Series({'indiranagar': 38332521, 'bml': 26448193,
                        'new york': 19651127}, name='population')
print(area)
population

indiranagar    1723337
bml             695662
btm             423967
Name: area, dtype: int64

indiranagar    38332521
bml            26448193
new york       19651127
Name: population, dtype: int64

In [63]:
population / area

bml            38.018740
btm                  NaN
indiranagar    22.243195
new york             NaN
dtype: float64

In [64]:
area.index | population.index

Index(['bml', 'btm', 'indiranagar', 'new york'], dtype='object')

In [65]:
A = pd.Series([12, 224, 456], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
print(A)
print(B)
B
A + B

0     12
1    224
2    456
dtype: int64
1    1
2    3
3    5
dtype: int64

0      NaN
1    225.0
2    459.0
3      NaN
dtype: float64

In [66]:
A.add(B, fill_value=0)

0     12.0
1    225.0
2    459.0
3      5.0
dtype: float64

In [84]:
df

     Name  age  year  nonsense  series_aligned
0   abdul   20  1999  0.010005               0
1    ahad   21  1999  0.010505               1
2   irfan   24  1996  0.012024               2
3  farhan   11  2007  0.005481               3

In [87]:
df2 = pd.DataFrame({"Name": ["abdul", "ahad", "irfan","farhan"], "Population": ["100000", "200000", "300000","400000"]})
df2

     Name Population
0   abdul     100000
1    ahad     200000
2   irfan     300000
3  farhan     400000

In [88]:
df.merge(df2)

     Name  age  year  nonsense  series_aligned Population
0   abdul   20  1999  0.010005               0     100000
1    ahad   21  1999  0.010505               1     200000
2   irfan   24  1996  0.012024               2     300000
3  farhan   11  2007  0.005481               3     400000

In [96]:
df3 = pd.DataFrame({"Name": ["abdul", "ahad","irfan","farhan"], "Population": ["100000", "200000",300000,400000]})
df3
df.merge(df3, right_on='Name', left_on='Name')

     Name  age  year  nonsense  series_aligned Population
0   abdul   20  1999  0.010005               0     100000
1    ahad   21  1999  0.010505               1     200000
2   irfan   24  1996  0.012024               2     300000
3  farhan   11  2007  0.005481               3     400000

In [97]:
df4 = pd.DataFrame({"Name": ["abdul", "ahad" ,"ram"], "Population": ["100000", "200000", "50000"]})
df.merge(df4, how='outer')

     Name   age    year  nonsense  series_aligned Population
0   abdul  20.0  1999.0  0.010005             0.0     100000
1    ahad  21.0  1999.0  0.010505             1.0     200000
2   irfan  24.0  1996.0  0.012024             2.0        NaN
3  farhan  11.0  2007.0  0.005481             3.0        NaN
4     ram   NaN     NaN       NaN             NaN      50000

In [98]:
df5 = pd.DataFrame({"Name": ["abdul", "ahad", "abdul"], "Population": ["100000", "200000", "50000"]})
print(df)
df.merge(df5, how='outer')

     Name  age  year  nonsense  series_aligned
0   abdul   20  1999  0.010005               0
1    ahad   21  1999  0.010505               1
2   irfan   24  1996  0.012024               2
3  farhan   11  2007  0.005481               3

     Name  age  year  nonsense  series_aligned Population
0   abdul   20  1999  0.010005               0     100000
1   abdul   20  1999  0.010005               0      50000
2    ahad   21  1999  0.010505               1     200000
3   irfan   24  1996  0.012024               2        NaN
4  farhan   11  2007  0.005481               3        NaN

In [101]:
serie_a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],index=['f', 'e', 'd', 'c', 'b', 'a'])
serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64),index=['f', 'e', 'd', 'c', 'b', 'a'])

In [102]:
serie_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [103]:
serie_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [104]:
pd.Series(np.where(pd.isnull(serie_a), serie_b, serie_a), index=serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [105]:
serie_a.combine_first(serie_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64